/**
  ******************************************************************************
  * @file    bsp_systick.c
  * @author  SuperLi
  * @version V1.0
  * @date    2025-05-23
  * @brief   系统定时器中断函数接口
  ******************************************************************************
  * @attention
  * 实验平台:野火  STM32 F407 开发板  
  ******************************************************************************
  * @cfg	
  * 无
  ******************************************************************************
  */
	
#include "bsp_systick.h"

/**************************************************************************
函数简介    系统定时器初始化
参数说明    无
返回参数    无
使用示例    SysTick_Init();
备注信息  	* SystemFrequency / 1000    1ms中断一次
						* SystemFrequency / 100000	 10us中断一次
						* SystemFrequency / 1000000 1us中断一次
						* 
**************************************************************************/
void SysTick_Init(void)
{
	if (SysTick_Config(SystemCoreClock / 1000))
	{ 
		/* Capture error */ 
		while (1);
	}
}

/* 全局延时计数器 */
__IO u32 TimingDelay;
/**************************************************************************
函数简介    延时函数
参数说明    __IO u32 nTime 要延时的毫秒数
返回参数    无
使用示例    Delay_ms(1000); 延时1000ms—>1s
备注信息    修改系统定时器中断周期时需同步调整此函数逻辑
**************************************************************************/
void Systick_Delay_ms(__IO u32 nTime)
{ 
	TimingDelay = nTime;	
	
	/* 阻塞等待直到定时器中断将计数器减为0 */
	while(TimingDelay != 0);
}


//void SysTick_Delay_Ms( __IO uint32_t ms)
//{
//	uint32_t i;	
//	SysTick_Config(SystemCoreClock/1000);
//	
//	for(i=0;i<ms;i++)
//	{
//		// 当计数器的值减小到0的时候，CRTL寄存器的位16会置1
//		// 当置1时，读取该位会清0
//		while( !((SysTick->CTRL)&(1<<16)) );
//	}
//	// 关闭SysTick定时器
//	SysTick->CTRL &=~ SysTick_CTRL_ENABLE_Msk;
//}




